
"""
Task 4
Написать свой модуль utils и перенести в него функцию currency_rates()
из предыдущего задания. Создать скрипт, в котором импортировать этот модуль
и выполнить несколько вызовов функции currency_rates(). Убедиться, что ничего
лишнего не происходит.
"""

import lesson_four_task_2

print(lesson_four_task_2.currency_rates('USD'))
